{
	"nodes":[
		{"op":"null","name":"Input","attr":{},"inputs":[]},
		{"op":"null","name":"seq_0","attr":{},"inputs":[]},
		{"op":"null","name":"2.State","attr":{},"inputs":[]},
		{"op":"null","name":"2.CellState","attr":{},"inputs":[]},
		{"op":"cast","name":"1$0","attr":{"dtype":"int32"},"inputs":[[0,0,0]]},
		{"op":"_PlusScalar","name":"1$1","attr":{"scalar":"-1.0"},"inputs":[[4,0,0]]},
		{"op":"one_hot","name":"1$2","attr":{"depth":"33"},"inputs":[[5,0,0]]},
		{"op":"null","name":"2.InputGateInputWeights","attr":{},"inputs":[]},
		{"op":"null","name":"2.InputGateStateWeights","attr":{},"inputs":[]},
		{"op":"null","name":"2.InputGateBiases","attr":{},"inputs":[]},
		{"op":"null","name":"2.OutputGateInputWeights","attr":{},"inputs":[]},
		{"op":"null","name":"2.OutputGateStateWeights","attr":{},"inputs":[]},
		{"op":"null","name":"2.OutputGateBiases","attr":{},"inputs":[]},
		{"op":"null","name":"2.ForgetGateInputWeights","attr":{},"inputs":[]},
		{"op":"null","name":"2.ForgetGateStateWeights","attr":{},"inputs":[]},
		{"op":"null","name":"2.ForgetGateBiases","attr":{},"inputs":[]},
		{"op":"null","name":"2.MemoryGateInputWeights","attr":{},"inputs":[]},
		{"op":"null","name":"2.MemoryGateStateWeights","attr":{},"inputs":[]},
		{"op":"null","name":"2.MemoryGateBiases","attr":{},"inputs":[]},
		{"op":"SliceChannel","name":"2$0","attr":{"axis":"1","num_outputs":"8","squeeze_axis":"true"},"inputs":[[6,0,0]]},
		{"op":"FullyConnected","name":"2$1","attr":{"num_hidden":"50"},"inputs":[[19,0,0],[7,0,0],[9,0,0]]},
		{"op":"FullyConnected","name":"2$2","attr":{"num_hidden":"50"},"inputs":[[19,1,0],[7,0,0],[9,0,0]]},
		{"op":"FullyConnected","name":"2$3","attr":{"num_hidden":"50"},"inputs":[[19,2,0],[7,0,0],[9,0,0]]},
		{"op":"FullyConnected","name":"2$4","attr":{"num_hidden":"50"},"inputs":[[19,3,0],[7,0,0],[9,0,0]]},
		{"op":"FullyConnected","name":"2$5","attr":{"num_hidden":"50"},"inputs":[[19,4,0],[7,0,0],[9,0,0]]},
		{"op":"FullyConnected","name":"2$6","attr":{"num_hidden":"50"},"inputs":[[19,5,0],[7,0,0],[9,0,0]]},
		{"op":"FullyConnected","name":"2$7","attr":{"num_hidden":"50"},"inputs":[[19,6,0],[7,0,0],[9,0,0]]},
		{"op":"FullyConnected","name":"2$8","attr":{"num_hidden":"50"},"inputs":[[19,7,0],[7,0,0],[9,0,0]]},
		{"op":"FullyConnected","name":"2$9","attr":{"num_hidden":"50"},"inputs":[[19,0,0],[10,0,0],[12,0,0]]},
		{"op":"FullyConnected","name":"2$10","attr":{"num_hidden":"50"},"inputs":[[19,1,0],[10,0,0],[12,0,0]]},
		{"op":"FullyConnected","name":"2$11","attr":{"num_hidden":"50"},"inputs":[[19,2,0],[10,0,0],[12,0,0]]},
		{"op":"FullyConnected","name":"2$12","attr":{"num_hidden":"50"},"inputs":[[19,3,0],[10,0,0],[12,0,0]]},
		{"op":"FullyConnected","name":"2$13","attr":{"num_hidden":"50"},"inputs":[[19,4,0],[10,0,0],[12,0,0]]},
		{"op":"FullyConnected","name":"2$14","attr":{"num_hidden":"50"},"inputs":[[19,5,0],[10,0,0],[12,0,0]]},
		{"op":"FullyConnected","name":"2$15","attr":{"num_hidden":"50"},"inputs":[[19,6,0],[10,0,0],[12,0,0]]},
		{"op":"FullyConnected","name":"2$16","attr":{"num_hidden":"50"},"inputs":[[19,7,0],[10,0,0],[12,0,0]]},
		{"op":"FullyConnected","name":"2$17","attr":{"num_hidden":"50"},"inputs":[[19,0,0],[13,0,0],[15,0,0]]},
		{"op":"FullyConnected","name":"2$18","attr":{"num_hidden":"50"},"inputs":[[19,1,0],[13,0,0],[15,0,0]]},
		{"op":"FullyConnected","name":"2$19","attr":{"num_hidden":"50"},"inputs":[[19,2,0],[13,0,0],[15,0,0]]},
		{"op":"FullyConnected","name":"2$20","attr":{"num_hidden":"50"},"inputs":[[19,3,0],[13,0,0],[15,0,0]]},
		{"op":"FullyConnected","name":"2$21","attr":{"num_hidden":"50"},"inputs":[[19,4,0],[13,0,0],[15,0,0]]},
		{"op":"FullyConnected","name":"2$22","attr":{"num_hidden":"50"},"inputs":[[19,5,0],[13,0,0],[15,0,0]]},
		{"op":"FullyConnected","name":"2$23","attr":{"num_hidden":"50"},"inputs":[[19,6,0],[13,0,0],[15,0,0]]},
		{"op":"FullyConnected","name":"2$24","attr":{"num_hidden":"50"},"inputs":[[19,7,0],[13,0,0],[15,0,0]]},
		{"op":"FullyConnected","name":"2$25","attr":{"num_hidden":"50"},"inputs":[[19,0,0],[16,0,0],[18,0,0]]},
		{"op":"FullyConnected","name":"2$26","attr":{"num_hidden":"50"},"inputs":[[19,1,0],[16,0,0],[18,0,0]]},
		{"op":"FullyConnected","name":"2$27","attr":{"num_hidden":"50"},"inputs":[[19,2,0],[16,0,0],[18,0,0]]},
		{"op":"FullyConnected","name":"2$28","attr":{"num_hidden":"50"},"inputs":[[19,3,0],[16,0,0],[18,0,0]]},
		{"op":"FullyConnected","name":"2$29","attr":{"num_hidden":"50"},"inputs":[[19,4,0],[16,0,0],[18,0,0]]},
		{"op":"FullyConnected","name":"2$30","attr":{"num_hidden":"50"},"inputs":[[19,5,0],[16,0,0],[18,0,0]]},
		{"op":"FullyConnected","name":"2$31","attr":{"num_hidden":"50"},"inputs":[[19,6,0],[16,0,0],[18,0,0]]},
		{"op":"FullyConnected","name":"2$32","attr":{"num_hidden":"50"},"inputs":[[19,7,0],[16,0,0],[18,0,0]]},
		{"op":"FullyConnected","name":"2$33","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[2,0,0],[8,0,0]]},
		{"op":"_Plus","name":"2$34","attr":{},"inputs":[[20,0,0],[52,0,0]]},
		{"op":"sigmoid","name":"2$35","attr":{},"inputs":[[53,0,0]]},
		{"op":"FullyConnected","name":"2$36","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[2,0,0],[11,0,0]]},
		{"op":"_Plus","name":"2$37","attr":{},"inputs":[[28,0,0],[55,0,0]]},
		{"op":"sigmoid","name":"2$38","attr":{},"inputs":[[56,0,0]]},
		{"op":"FullyConnected","name":"2$39","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[2,0,0],[14,0,0]]},
		{"op":"_Plus","name":"2$40","attr":{},"inputs":[[36,0,0],[58,0,0]]},
		{"op":"sigmoid","name":"2$41","attr":{},"inputs":[[59,0,0]]},
		{"op":"FullyConnected","name":"2$42","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[2,0,0],[17,0,0]]},
		{"op":"_Plus","name":"2$43","attr":{},"inputs":[[44,0,0],[61,0,0]]},
		{"op":"tanh","name":"2$44","attr":{},"inputs":[[62,0,0]]},
		{"op":"_Mul","name":"2$45","attr":{"__force_mirroring__":"True"},"inputs":[[60,0,0],[3,0,0]]},
		{"op":"_Mul","name":"2$46","attr":{"__force_mirroring__":"True"},"inputs":[[54,0,0],[63,0,0]]},
		{"op":"_Plus","name":"2$47","attr":{"__force_mirroring__":"True"},"inputs":[[64,0,0],[65,0,0]]},
		{"op":"tanh","name":"2$48","attr":{"__force_mirroring__":"True"},"inputs":[[66,0,0]]},
		{"op":"_Mul","name":"2$49","attr":{"__force_mirroring__":"True"},"inputs":[[57,0,0],[67,0,0]]},
		{"op":"FullyConnected","name":"2$50","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[68,0,0],[8,0,0]]},
		{"op":"_Plus","name":"2$51","attr":{},"inputs":[[21,0,0],[69,0,0]]},
		{"op":"sigmoid","name":"2$52","attr":{},"inputs":[[70,0,0]]},
		{"op":"FullyConnected","name":"2$53","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[68,0,0],[11,0,0]]},
		{"op":"_Plus","name":"2$54","attr":{},"inputs":[[29,0,0],[72,0,0]]},
		{"op":"sigmoid","name":"2$55","attr":{},"inputs":[[73,0,0]]},
		{"op":"FullyConnected","name":"2$56","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[68,0,0],[14,0,0]]},
		{"op":"_Plus","name":"2$57","attr":{},"inputs":[[37,0,0],[75,0,0]]},
		{"op":"sigmoid","name":"2$58","attr":{},"inputs":[[76,0,0]]},
		{"op":"FullyConnected","name":"2$59","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[68,0,0],[17,0,0]]},
		{"op":"_Plus","name":"2$60","attr":{},"inputs":[[45,0,0],[78,0,0]]},
		{"op":"tanh","name":"2$61","attr":{},"inputs":[[79,0,0]]},
		{"op":"_Mul","name":"2$62","attr":{"__force_mirroring__":"True"},"inputs":[[77,0,0],[66,0,0]]},
		{"op":"_Mul","name":"2$63","attr":{"__force_mirroring__":"True"},"inputs":[[71,0,0],[80,0,0]]},
		{"op":"_Plus","name":"2$64","attr":{"__force_mirroring__":"True"},"inputs":[[81,0,0],[82,0,0]]},
		{"op":"tanh","name":"2$65","attr":{"__force_mirroring__":"True"},"inputs":[[83,0,0]]},
		{"op":"_Mul","name":"2$66","attr":{"__force_mirroring__":"True"},"inputs":[[74,0,0],[84,0,0]]},
		{"op":"FullyConnected","name":"2$67","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[85,0,0],[8,0,0]]},
		{"op":"_Plus","name":"2$68","attr":{},"inputs":[[22,0,0],[86,0,0]]},
		{"op":"sigmoid","name":"2$69","attr":{},"inputs":[[87,0,0]]},
		{"op":"FullyConnected","name":"2$70","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[85,0,0],[11,0,0]]},
		{"op":"_Plus","name":"2$71","attr":{},"inputs":[[30,0,0],[89,0,0]]},
		{"op":"sigmoid","name":"2$72","attr":{},"inputs":[[90,0,0]]},
		{"op":"FullyConnected","name":"2$73","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[85,0,0],[14,0,0]]},
		{"op":"_Plus","name":"2$74","attr":{},"inputs":[[38,0,0],[92,0,0]]},
		{"op":"sigmoid","name":"2$75","attr":{},"inputs":[[93,0,0]]},
		{"op":"FullyConnected","name":"2$76","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[85,0,0],[17,0,0]]},
		{"op":"_Plus","name":"2$77","attr":{},"inputs":[[46,0,0],[95,0,0]]},
		{"op":"tanh","name":"2$78","attr":{},"inputs":[[96,0,0]]},
		{"op":"_Mul","name":"2$79","attr":{"__force_mirroring__":"True"},"inputs":[[94,0,0],[83,0,0]]},
		{"op":"_Mul","name":"2$80","attr":{"__force_mirroring__":"True"},"inputs":[[88,0,0],[97,0,0]]},
		{"op":"_Plus","name":"2$81","attr":{"__force_mirroring__":"True"},"inputs":[[98,0,0],[99,0,0]]},
		{"op":"tanh","name":"2$82","attr":{"__force_mirroring__":"True"},"inputs":[[100,0,0]]},
		{"op":"_Mul","name":"2$83","attr":{"__force_mirroring__":"True"},"inputs":[[91,0,0],[101,0,0]]},
		{"op":"FullyConnected","name":"2$84","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[102,0,0],[8,0,0]]},
		{"op":"_Plus","name":"2$85","attr":{},"inputs":[[23,0,0],[103,0,0]]},
		{"op":"sigmoid","name":"2$86","attr":{},"inputs":[[104,0,0]]},
		{"op":"FullyConnected","name":"2$87","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[102,0,0],[11,0,0]]},
		{"op":"_Plus","name":"2$88","attr":{},"inputs":[[31,0,0],[106,0,0]]},
		{"op":"sigmoid","name":"2$89","attr":{},"inputs":[[107,0,0]]},
		{"op":"FullyConnected","name":"2$90","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[102,0,0],[14,0,0]]},
		{"op":"_Plus","name":"2$91","attr":{},"inputs":[[39,0,0],[109,0,0]]},
		{"op":"sigmoid","name":"2$92","attr":{},"inputs":[[110,0,0]]},
		{"op":"FullyConnected","name":"2$93","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[102,0,0],[17,0,0]]},
		{"op":"_Plus","name":"2$94","attr":{},"inputs":[[47,0,0],[112,0,0]]},
		{"op":"tanh","name":"2$95","attr":{},"inputs":[[113,0,0]]},
		{"op":"_Mul","name":"2$96","attr":{"__force_mirroring__":"True"},"inputs":[[111,0,0],[100,0,0]]},
		{"op":"_Mul","name":"2$97","attr":{"__force_mirroring__":"True"},"inputs":[[105,0,0],[114,0,0]]},
		{"op":"_Plus","name":"2$98","attr":{"__force_mirroring__":"True"},"inputs":[[115,0,0],[116,0,0]]},
		{"op":"tanh","name":"2$99","attr":{"__force_mirroring__":"True"},"inputs":[[117,0,0]]},
		{"op":"_Mul","name":"2$100","attr":{"__force_mirroring__":"True"},"inputs":[[108,0,0],[118,0,0]]},
		{"op":"FullyConnected","name":"2$101","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[119,0,0],[8,0,0]]},
		{"op":"_Plus","name":"2$102","attr":{},"inputs":[[24,0,0],[120,0,0]]},
		{"op":"sigmoid","name":"2$103","attr":{},"inputs":[[121,0,0]]},
		{"op":"FullyConnected","name":"2$104","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[119,0,0],[11,0,0]]},
		{"op":"_Plus","name":"2$105","attr":{},"inputs":[[32,0,0],[123,0,0]]},
		{"op":"sigmoid","name":"2$106","attr":{},"inputs":[[124,0,0]]},
		{"op":"FullyConnected","name":"2$107","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[119,0,0],[14,0,0]]},
		{"op":"_Plus","name":"2$108","attr":{},"inputs":[[40,0,0],[126,0,0]]},
		{"op":"sigmoid","name":"2$109","attr":{},"inputs":[[127,0,0]]},
		{"op":"FullyConnected","name":"2$110","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[119,0,0],[17,0,0]]},
		{"op":"_Plus","name":"2$111","attr":{},"inputs":[[48,0,0],[129,0,0]]},
		{"op":"tanh","name":"2$112","attr":{},"inputs":[[130,0,0]]},
		{"op":"_Mul","name":"2$113","attr":{"__force_mirroring__":"True"},"inputs":[[128,0,0],[117,0,0]]},
		{"op":"_Mul","name":"2$114","attr":{"__force_mirroring__":"True"},"inputs":[[122,0,0],[131,0,0]]},
		{"op":"_Plus","name":"2$115","attr":{"__force_mirroring__":"True"},"inputs":[[132,0,0],[133,0,0]]},
		{"op":"tanh","name":"2$116","attr":{"__force_mirroring__":"True"},"inputs":[[134,0,0]]},
		{"op":"_Mul","name":"2$117","attr":{"__force_mirroring__":"True"},"inputs":[[125,0,0],[135,0,0]]},
		{"op":"FullyConnected","name":"2$118","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[136,0,0],[8,0,0]]},
		{"op":"_Plus","name":"2$119","attr":{},"inputs":[[25,0,0],[137,0,0]]},
		{"op":"sigmoid","name":"2$120","attr":{},"inputs":[[138,0,0]]},
		{"op":"FullyConnected","name":"2$121","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[136,0,0],[11,0,0]]},
		{"op":"_Plus","name":"2$122","attr":{},"inputs":[[33,0,0],[140,0,0]]},
		{"op":"sigmoid","name":"2$123","attr":{},"inputs":[[141,0,0]]},
		{"op":"FullyConnected","name":"2$124","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[136,0,0],[14,0,0]]},
		{"op":"_Plus","name":"2$125","attr":{},"inputs":[[41,0,0],[143,0,0]]},
		{"op":"sigmoid","name":"2$126","attr":{},"inputs":[[144,0,0]]},
		{"op":"FullyConnected","name":"2$127","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[136,0,0],[17,0,0]]},
		{"op":"_Plus","name":"2$128","attr":{},"inputs":[[49,0,0],[146,0,0]]},
		{"op":"tanh","name":"2$129","attr":{},"inputs":[[147,0,0]]},
		{"op":"_Mul","name":"2$130","attr":{"__force_mirroring__":"True"},"inputs":[[145,0,0],[134,0,0]]},
		{"op":"_Mul","name":"2$131","attr":{"__force_mirroring__":"True"},"inputs":[[139,0,0],[148,0,0]]},
		{"op":"_Plus","name":"2$132","attr":{"__force_mirroring__":"True"},"inputs":[[149,0,0],[150,0,0]]},
		{"op":"tanh","name":"2$133","attr":{"__force_mirroring__":"True"},"inputs":[[151,0,0]]},
		{"op":"_Mul","name":"2$134","attr":{"__force_mirroring__":"True"},"inputs":[[142,0,0],[152,0,0]]},
		{"op":"FullyConnected","name":"2$135","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[153,0,0],[8,0,0]]},
		{"op":"_Plus","name":"2$136","attr":{},"inputs":[[26,0,0],[154,0,0]]},
		{"op":"sigmoid","name":"2$137","attr":{},"inputs":[[155,0,0]]},
		{"op":"FullyConnected","name":"2$138","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[153,0,0],[11,0,0]]},
		{"op":"_Plus","name":"2$139","attr":{},"inputs":[[34,0,0],[157,0,0]]},
		{"op":"sigmoid","name":"2$140","attr":{},"inputs":[[158,0,0]]},
		{"op":"FullyConnected","name":"2$141","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[153,0,0],[14,0,0]]},
		{"op":"_Plus","name":"2$142","attr":{},"inputs":[[42,0,0],[160,0,0]]},
		{"op":"sigmoid","name":"2$143","attr":{},"inputs":[[161,0,0]]},
		{"op":"FullyConnected","name":"2$144","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[153,0,0],[17,0,0]]},
		{"op":"_Plus","name":"2$145","attr":{},"inputs":[[50,0,0],[163,0,0]]},
		{"op":"tanh","name":"2$146","attr":{},"inputs":[[164,0,0]]},
		{"op":"_Mul","name":"2$147","attr":{"__force_mirroring__":"True"},"inputs":[[162,0,0],[151,0,0]]},
		{"op":"_Mul","name":"2$148","attr":{"__force_mirroring__":"True"},"inputs":[[156,0,0],[165,0,0]]},
		{"op":"_Plus","name":"2$149","attr":{"__force_mirroring__":"True"},"inputs":[[166,0,0],[167,0,0]]},
		{"op":"tanh","name":"2$150","attr":{"__force_mirroring__":"True"},"inputs":[[168,0,0]]},
		{"op":"_Mul","name":"2$151","attr":{"__force_mirroring__":"True"},"inputs":[[159,0,0],[169,0,0]]},
		{"op":"FullyConnected","name":"2$152","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[170,0,0],[8,0,0]]},
		{"op":"_Plus","name":"2$153","attr":{},"inputs":[[27,0,0],[171,0,0]]},
		{"op":"sigmoid","name":"2$154","attr":{},"inputs":[[172,0,0]]},
		{"op":"FullyConnected","name":"2$155","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[170,0,0],[11,0,0]]},
		{"op":"_Plus","name":"2$156","attr":{},"inputs":[[35,0,0],[174,0,0]]},
		{"op":"sigmoid","name":"2$157","attr":{},"inputs":[[175,0,0]]},
		{"op":"FullyConnected","name":"2$158","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[170,0,0],[14,0,0]]},
		{"op":"_Plus","name":"2$159","attr":{},"inputs":[[43,0,0],[177,0,0]]},
		{"op":"sigmoid","name":"2$160","attr":{},"inputs":[[178,0,0]]},
		{"op":"FullyConnected","name":"2$161","attr":{"num_hidden":"50","no_bias":"true"},"inputs":[[170,0,0],[17,0,0]]},
		{"op":"_Plus","name":"2$162","attr":{},"inputs":[[51,0,0],[180,0,0]]},
		{"op":"tanh","name":"2$163","attr":{},"inputs":[[181,0,0]]},
		{"op":"_Mul","name":"2$164","attr":{"__force_mirroring__":"True"},"inputs":[[179,0,0],[168,0,0]]},
		{"op":"_Mul","name":"2$165","attr":{"__force_mirroring__":"True"},"inputs":[[173,0,0],[182,0,0]]},
		{"op":"_Plus","name":"2$166","attr":{"__force_mirroring__":"True"},"inputs":[[183,0,0],[184,0,0]]},
		{"op":"tanh","name":"2$167","attr":{"__force_mirroring__":"True"},"inputs":[[185,0,0]]},
		{"op":"_Mul","name":"2$168","attr":{"__force_mirroring__":"True"},"inputs":[[176,0,0],[186,0,0]]},
		{"op":"Concat","name":"3$0","attr":{"num_args":"8","dim":"0"},"inputs":[[68,0,0],[85,0,0],[102,0,0],[119,0,0],[136,0,0],[153,0,0],[170,0,0],[187,0,0]]},
		{"op":"Reshape","name":"3$1","attr":{"shape":"(8, -1, 50)"},"inputs":[[188,0,0]]},
		{"op":"SequenceLast","name":"3$2","attr":{"use_sequence_length":"true"},"inputs":[[189,0,0],[1,0,0]]},
		{"op":"null","name":"4.Weights","attr":{},"inputs":[]},
		{"op":"null","name":"4.Biases","attr":{},"inputs":[]},
		{"op":"FullyConnected","name":"4","attr":{"num_hidden":"64","no_bias":"False"},"inputs":[[190,0,0],[191,0,0],[192,0,0]]},
		{"op":"tanh","name":"5$0","attr":{},"inputs":[[193,0,0]]},
		{"op":"null","name":"6.Weights","attr":{},"inputs":[]},
		{"op":"null","name":"6.Biases","attr":{},"inputs":[]},
		{"op":"FullyConnected","name":"6","attr":{"num_hidden":"33","no_bias":"False"},"inputs":[[194,0,0],[195,0,0],[196,0,0]]},
		{"op":"SoftmaxActivation","name":"7$0","attr":{},"inputs":[[197,0,0]]}
	],
	"arg_nodes":[0,1,2,3,7,8,9,10,11,12,13,14,15,16,17,18,191,192,195,196],
	"heads":[
		[198,0,0]
	],
	"attrs":{
		"mxnet_version":["int",905]
	}
}